package main

import "fmt"

func main() {
	// простой обмен значениями через XOR преобразование
	//
	// складывать числа опасно - можем выйти за рамки 32 бит
	var a, b int32
	a, b = 12356, 73256

	fmt.Printf("%d\t%32b\n%d\t%32b\n", a, a, b, b)
	a = a ^ b
	fmt.Printf("xor:\t%32b\n", a)

	b = a ^ b
	a = a ^ b
	fmt.Printf("%d\t%32b\n%d\t%32b\n", a, a, b, b)

	/*
		12356                     11000001000100
		73256                  10001111000101000
		xor:                   10010111001101100
		73256                  10001111000101000
		12356                     11000001000100
	*/
}
